In [1]:
import sqlite3

In [2]:
dbms=sqlite3.connect("student2.db")

In [3]:
cur=dbms.cursor()

In [177]:
cur.execute('create table student2(rollno int primary key,name text,marks int)')
dbms.commit()

OperationalError: table student2 already exists

In [7]:
cur.execute('insert into student2 values(001,"shrey",20),(002,"pri",60),(003,"rish",50),(004,"kjp",30)')
dbms.commit()

IntegrityError: UNIQUE constraint failed: student2.rollno

In [17]:
result=cur.execute('select * from student2')
for res in result:
    print(res)

(1, 'shrey', 20)
(2, 'pri', 60)
(3, 'rish', 50)
(4, 'kjp', 30)
(5, 'rajdeep', 80)
(6, 'roni', 50)
(7, 'rishi', 90)
(8, 'piu', 70)
(9, 'deep', 80)
(10, 'oni', 50)
(11, 'shiv', 90)
(12, 'pisi', 70)

In [13]:
cur.execute('insert into student2 values(005,"rajdeep",80),(006,"roni",50),(007,"rishi",90),(008,"piu",70)')
dbms.commit()

IntegrityError: UNIQUE constraint failed: student2.rollno

In [16]:
cur.execute('insert into student2 values(009,"deep",80),(010,"oni",50),(011,"shiv",90),(012,"pisi",70)')
dbms.commit()

IntegrityError: UNIQUE constraint failed: student2.rollno

In [21]:
import os

In [22]:
import sqlite3

In [24]:
os.mkdir("E:/mysqlite")

In [178]:
db=sqlite3.connect("E:/mysqlite/employee1.db")

In [179]:
cur=db.cursor()

In [180]:
cur.execute('create table employee(empcode int primary key,name text,branch text,salary float)')
db.commit()

In [185]:
cur.execute('insert into employee values (101, "jhon", "Kolkata", 50000.0),(102, "Richard", "Durgapur", 45000.0),(103, "David", "Mumbai", 40000.0),(104, "jeams", "bangalore", 20000.0),(105, "jonyshingh", "usa", 100000.0),(106, "jash", "pune", 60000.0),(107, "joli", "chennai", 70000.0)')
db.commit()

IntegrityError: UNIQUE constraint failed: employee.empcode

In [193]:
result=cur.execute('select * from employee')
for res in result:
    print(res)

(101, 'jhon', 'Kolkata', 50000.0)
(102, 'Richard', 'Durgapur', 45000.0)
(103, 'David', 'Mumbai', 40000.0)
(104, 'jeams', 'bangalore', 20000.0)
(105, 'jonyshingh', 'usa', 100000.0)
(106, 'jash', 'pune', 60000.0)
(107, 'joli', 'chennai', 70000.0)
(108, 'jho', 'Kolkata', 50000.0)
(109, 'Ricd', 'Durgapur', 45000.0)
(110, 'keshab', 'london', 80000.0)
(111, 'kish', 'france', 60000.0)
(112, 'jho', 'Kolkata', 50000.0)
(1113, 'Ricd', 'Durgapur', 45000.0)
(113, 'jhoN', 'Kolkata', 50000.0)
(114, 'RiCHIE', 'Durgapur', 45000.0)
(115, 'keshab', 'london', 80000.0)
(116, 'kesto', 'Kolkata', 50000.0)

In [187]:
result=cur.execute('select * from employee')
result.fetchall()

[(101, 'jhon', 'Kolkata', 50000.0),
 (102, 'Richard', 'Durgapur', 45000.0),
 (103, 'David', 'Mumbai', 40000.0),
 (104, 'jeams', 'bangalore', 20000.0),
 (105, 'jonyshingh', 'usa', 100000.0),
 (106, 'jash', 'pune', 60000.0),
 (107, 'joli', 'chennai', 70000.0)]

In [188]:
cur.execute('insert into employee values (108, "jho", "Kolkata", 50000.0),(109, "Ricd", "Durgapur", 45000.0),(110,"keshab","london",80000.0),(111,"kish","france",60000.0)')
db.commit()

In [189]:
cur.execute('insert into employee values (112, "jho", "Kolkata", 50000.0),(1113, "Ricd", "Durgapur", 45000.0)')
db.commit()

print(cur.rowcount, "RECORDS INSERTED")

2 RECORDS INSERTED

In [190]:
cur.execute('insert into employee values (113, "jhoN", "Kolkata", 50000.0),(114, "RiCHIE", "Durgapur", 45000.0),(115,"keshab","london",80000.0)')
db.commit()

print(cur.rowcount, "ROW INSERTED")

3 ROW INSERTED

In [191]:
cur.execute('insert into employee values (116, "kesto", "Kolkata", 50000.0)')
print(cur.rowcount, "Rows Insert")
db.commit()

1 Rows Insert

In [192]:
result=cur.execute('select empcode from employee where salary between 50000.0 and 100000.0')
for res in result:
    print(res)

(101,)
(105,)
(106,)
(107,)
(108,)
(110,)
(111,)
(112,)
(113,)
(115,)
(116,)

In [56]:
result=cur.execute('select empcode from employee where salary is 50000.0')
for res in result:
    print(res)

(101,)
(108,)
(112,)
(113,)
(116,)

In [64]:
result=cur.execute('select * from employee where branch is ("Durgapur")')
result.fetchall()

[(102, 'Richard', 'Durgapur', 45000.0),
 (109, 'Ricd', 'Durgapur', 45000.0),
 (1113, 'Ricd', 'Durgapur', 45000.0),
 (114, 'RiCHIE', 'Durgapur', 45000.0)]

In [67]:
result=cur.execute('select * from employee where salary is 50000.0')
result.fetchall()

[(101, 'jhon', 'Kolkata', 50000.0),
 (108, 'jho', 'Kolkata', 50000.0),
 (112, 'jho', 'Kolkata', 50000.0),
 (113, 'jhoN', 'Kolkata', 50000.0),
 (116, 'kesto', 'Kolkata', 50000.0)]

In [65]:
result=cur.execute('select * from employee limit 5')
result.fetchall()

[(101, 'jhon', 'Kolkata', 50000.0),
 (102, 'Richard', 'Durgapur', 45000.0),
 (103, 'David', 'Mumbai', 40000.0),
 (104, 'jeams', 'bangalore', 20000.0),
 (105, 'jonyshingh', 'usa', 100000.0)]

In [71]:
result=cur.execute('select * from employee where salary<=50000.0')
result.fetchall()

[(101, 'jhon', 'Kolkata', 50000.0),
 (102, 'Richard', 'Durgapur', 45000.0),
 (103, 'David', 'Mumbai', 40000.0),
 (104, 'jeams', 'bangalore', 20000.0),
 (108, 'jho', 'Kolkata', 50000.0),
 (109, 'Ricd', 'Durgapur', 45000.0),
 (112, 'jho', 'Kolkata', 50000.0),
 (1113, 'Ricd', 'Durgapur', 45000.0),
 (113, 'jhoN', 'Kolkata', 50000.0),
 (114, 'RiCHIE', 'Durgapur', 45000.0),
 (116, 'kesto', 'Kolkata', 50000.0)]

In [70]:
result=cur.execute('select * from employee where salary>=50000.0')
result.fetchall()

[(101, 'jhon', 'Kolkata', 50000.0),
 (105, 'jonyshingh', 'usa', 100000.0),
 (106, 'jash', 'pune', 60000.0),
 (107, 'joli', 'chennai', 70000.0),
 (108, 'jho', 'Kolkata', 50000.0),
 (110, 'keshab', 'london', 80000.0),
 (111, 'kish', 'france', 60000.0),
 (112, 'jho', 'Kolkata', 50000.0),
 (113, 'jhoN', 'Kolkata', 50000.0),
 (115, 'keshab', 'london', 80000.0),
 (116, 'kesto', 'Kolkata', 50000.0)]

In [75]:
result=cur.execute('select * from employee order by branch asc')
result.fetchall()

[(102, 'Richard', 'Durgapur', 45000.0),
 (109, 'Ricd', 'Durgapur', 45000.0),
 (1113, 'Ricd', 'Durgapur', 45000.0),
 (114, 'RiCHIE', 'Durgapur', 45000.0),
 (101, 'jhon', 'Kolkata', 50000.0),
 (108, 'jho', 'Kolkata', 50000.0),
 (112, 'jho', 'Kolkata', 50000.0),
 (113, 'jhoN', 'Kolkata', 50000.0),
 (116, 'kesto', 'Kolkata', 50000.0),
 (103, 'David', 'Mumbai', 40000.0),
 (104, 'jeams', 'bangalore', 20000.0),
 (107, 'joli', 'chennai', 70000.0),
 (111, 'kish', 'france', 60000.0),
 (110, 'keshab', 'london', 80000.0),
 (115, 'keshab', 'london', 80000.0),
 (106, 'jash', 'pune', 60000.0),
 (105, 'jonyshingh', 'usa', 100000.0)]

In [76]:
result=cur.execute('select * from employee order by name asc')
result.fetchall()

[(103, 'David', 'Mumbai', 40000.0),
 (114, 'RiCHIE', 'Durgapur', 45000.0),
 (109, 'Ricd', 'Durgapur', 45000.0),
 (1113, 'Ricd', 'Durgapur', 45000.0),
 (102, 'Richard', 'Durgapur', 45000.0),
 (106, 'jash', 'pune', 60000.0),
 (104, 'jeams', 'bangalore', 20000.0),
 (108, 'jho', 'Kolkata', 50000.0),
 (112, 'jho', 'Kolkata', 50000.0),
 (113, 'jhoN', 'Kolkata', 50000.0),
 (101, 'jhon', 'Kolkata', 50000.0),
 (107, 'joli', 'chennai', 70000.0),
 (105, 'jonyshingh', 'usa', 100000.0),
 (110, 'keshab', 'london', 80000.0),
 (115, 'keshab', 'london', 80000.0),
 (116, 'kesto', 'Kolkata', 50000.0),
 (111, 'kish', 'france', 60000.0)]

In [78]:
result=cur.execute('select * from employee order by name desc')
result.fetchall()

[(111, 'kish', 'france', 60000.0),
 (116, 'kesto', 'Kolkata', 50000.0),
 (110, 'keshab', 'london', 80000.0),
 (115, 'keshab', 'london', 80000.0),
 (105, 'jonyshingh', 'usa', 100000.0),
 (107, 'joli', 'chennai', 70000.0),
 (101, 'jhon', 'Kolkata', 50000.0),
 (113, 'jhoN', 'Kolkata', 50000.0),
 (108, 'jho', 'Kolkata', 50000.0),
 (112, 'jho', 'Kolkata', 50000.0),
 (104, 'jeams', 'bangalore', 20000.0),
 (106, 'jash', 'pune', 60000.0),
 (102, 'Richard', 'Durgapur', 45000.0),
 (109, 'Ricd', 'Durgapur', 45000.0),
 (1113, 'Ricd', 'Durgapur', 45000.0),
 (114, 'RiCHIE', 'Durgapur', 45000.0),
 (103, 'David', 'Mumbai', 40000.0)]

In [79]:
result=cur.execute('select * from employee order by salary desc')
result.fetchall()

[(105, 'jonyshingh', 'usa', 100000.0),
 (110, 'keshab', 'london', 80000.0),
 (115, 'keshab', 'london', 80000.0),
 (107, 'joli', 'chennai', 70000.0),
 (106, 'jash', 'pune', 60000.0),
 (111, 'kish', 'france', 60000.0),
 (101, 'jhon', 'Kolkata', 50000.0),
 (108, 'jho', 'Kolkata', 50000.0),
 (112, 'jho', 'Kolkata', 50000.0),
 (113, 'jhoN', 'Kolkata', 50000.0),
 (116, 'kesto', 'Kolkata', 50000.0),
 (102, 'Richard', 'Durgapur', 45000.0),
 (109, 'Ricd', 'Durgapur', 45000.0),
 (1113, 'Ricd', 'Durgapur', 45000.0),
 (114, 'RiCHIE', 'Durgapur', 45000.0),
 (103, 'David', 'Mumbai', 40000.0),
 (104, 'jeams', 'bangalore', 20000.0)]

AND OPERATOR

In [80]:
result=cur.execute('select * from employee where name="jhoN" and salary=50000.0')
result.fetchall()

[(113, 'jhoN', 'Kolkata', 50000.0)]

OR OPERATOR

In [89]:
result=cur.execute('select * from employee where name="jhoN" or salary=80000.0')
result.fetchall()

[(110, 'keshab', 'london', 80000.0),
 (113, 'jhoN', 'Kolkata', 50000.0),
 (115, 'keshab', 'london', 80000.0)]

In [90]:
result=cur.execute('select * from employee where branch="Durgapur" or salary=80000.0')
result.fetchall()

[(102, 'Richard', 'Durgapur', 45000.0),
 (109, 'Ricd', 'Durgapur', 45000.0),
 (110, 'keshab', 'london', 80000.0),
 (1113, 'Ricd', 'Durgapur', 45000.0),
 (114, 'RiCHIE', 'Durgapur', 45000.0),
 (115, 'keshab', 'london', 80000.0)]

AGGREGATE FUNCTIONS

MIN -Find Minimum

MAX -Find Maximum

SUM -Find Sum

AVG -Find Avarage

COUNT- Count Number of rows

In [91]:
result=cur.execute('select min(salary) from employee')
result.fetchall()

[(20000.0,)]

In [92]:
result=cur.execute('select max(salary) from employee')
result.fetchall()

[(100000.0,)]

In [93]:
result=cur.execute('select avg(salary) from employee')
result.fetchall()

[(55294.117647058825,)]

In [94]:
result=cur.execute('select sum(salary) from employee')
result.fetchall()

[(940000.0,)]

In [96]:
result=cur.execute('select count(empcode) from employee')
result.fetchall()

[(17,)]

In [97]:
result=cur.execute('select max(empcode) from employee')
result.fetchall()

[(1113,)]

In [100]:
result=cur.execute('select * from employee where salary is null')
result.fetchall()

[]

In [102]:
result=cur.execute('select * from employee where salary is not null')
result.fetchall()

[(101, 'jhon', 'Kolkata', 50000.0),
 (102, 'Richard', 'Durgapur', 45000.0),
 (103, 'David', 'Mumbai', 40000.0),
 (104, 'jeams', 'bangalore', 20000.0),
 (105, 'jonyshingh', 'usa', 100000.0),
 (106, 'jash', 'pune', 60000.0),
 (107, 'joli', 'chennai', 70000.0),
 (108, 'jho', 'Kolkata', 50000.0),
 (109, 'Ricd', 'Durgapur', 45000.0),
 (110, 'keshab', 'london', 80000.0),
 (111, 'kish', 'france', 60000.0),
 (112, 'jho', 'Kolkata', 50000.0),
 (1113, 'Ricd', 'Durgapur', 45000.0),
 (113, 'jhoN', 'Kolkata', 50000.0),
 (114, 'RiCHIE', 'Durgapur', 45000.0),
 (115, 'keshab', 'london', 80000.0),
 (116, 'kesto', 'Kolkata', 50000.0)]

LIKE OPERATOR

In [104]:
result=cur.execute('select * from employee where name like "j%" ')
result.fetchall()

[(101, 'jhon', 'Kolkata', 50000.0),
 (104, 'jeams', 'bangalore', 20000.0),
 (105, 'jonyshingh', 'usa', 100000.0),
 (106, 'jash', 'pune', 60000.0),
 (107, 'joli', 'chennai', 70000.0),
 (108, 'jho', 'Kolkata', 50000.0),
 (112, 'jho', 'Kolkata', 50000.0),
 (113, 'jhoN', 'Kolkata', 50000.0)]

In [105]:
result=cur.execute('select * from employee where name like "%a%" ')
result.fetchall()

[(102, 'Richard', 'Durgapur', 45000.0),
 (103, 'David', 'Mumbai', 40000.0),
 (104, 'jeams', 'bangalore', 20000.0),
 (106, 'jash', 'pune', 60000.0),
 (110, 'keshab', 'london', 80000.0),
 (115, 'keshab', 'london', 80000.0)]

In [106]:
result=cur.execute('select * from employee where name like "_____" ')
result.fetchall()

[(103, 'David', 'Mumbai', 40000.0),
 (104, 'jeams', 'bangalore', 20000.0),
 (116, 'kesto', 'Kolkata', 50000.0)]

In [110]:
result=cur.execute('select * from employee where name like "j____" ')
result.fetchall()

[(104, 'jeams', 'bangalore', 20000.0)]

In [116]:
result=cur.execute('select * from employee where name like "j___" ')
result.fetchall()

[(101, 'jhon', 'Kolkata', 50000.0),
 (106, 'jash', 'pune', 60000.0),
 (107, 'joli', 'chennai', 70000.0),
 (113, 'jhoN', 'Kolkata', 50000.0)]

In [118]:
result=cur.execute('select * from employee where name like "__a%" ')
result.fetchall()

[(104, 'jeams', 'bangalore', 20000.0)]

In [121]:
result=cur.execute('select * from employee where name like "_o%" ')
result.fetchall()

[(105, 'jonyshingh', 'usa', 100000.0), (107, 'joli', 'chennai', 70000.0)]

IN OPERATOR

In [153]:
result=cur.execute('select * from employee where salary not in (50000)')
result.fetchall()

[(102, 'Richard', 'Durgapur', 45000.0),
 (103, 'David', 'Mumbai', 40000.0),
 (104, 'jeams', 'bangalore', 20000.0),
 (105, 'jonyshingh', 'usa', 540000.0),
 (106, 'jash', 'pune', 540000.0),
 (107, 'joli', 'chennai', 70000.0),
 (109, 'Ricd', 'Durgapur', 45000.0),
 (110, 'keshab', 'london', 540000.0),
 (111, 'kish', 'france', 60000.0),
 (1113, 'Ricd', 'Durgapur', 45000.0),
 (113, 'jhoN', 'Kolkata', 540000.0),
 (114, 'RiCHIE', 'Durgapur', 45000.0),
 (115, 'keshab', 'london', 80000.0),
 (116, 'kesto', 'Kolkata', 540000.0)]

In [129]:
result=cur.execute('select * from employee where name not in ("jhon","David")')
result.fetchall()

[(102, 'Richard', 'Durgapur', 45000.0),
 (104, 'jeams', 'bangalore', 20000.0),
 (105, 'jonyshingh', 'usa', 100000.0),
 (106, 'jash', 'pune', 60000.0),
 (107, 'joli', 'chennai', 70000.0),
 (108, 'jho', 'Kolkata', 50000.0),
 (109, 'Ricd', 'Durgapur', 45000.0),
 (110, 'keshab', 'london', 80000.0),
 (111, 'kish', 'france', 60000.0),
 (112, 'jho', 'Kolkata', 50000.0),
 (1113, 'Ricd', 'Durgapur', 45000.0),
 (113, 'jhoN', 'Kolkata', 50000.0),
 (114, 'RiCHIE', 'Durgapur', 45000.0),
 (115, 'keshab', 'london', 80000.0),
 (116, 'kesto', 'Kolkata', 50000.0)]

In [157]:
result=cur.execute('select * from employee where salary in (50000)')
result.fetchall()

[(101, 'jhon', 'Kolkata', 50000.0),
 (108, 'jho', 'Kolkata', 50000.0),
 (112, 'jho', 'Kolkata', 50000.0)]

UPDATE RECORD

In [159]:
sql="update employee set salary=(780000)where empcode=110"
cur.execute(sql)
db.commit()

In [160]:
result=cur.execute("select * from employee")
for res in result:
    print(res)

(101, 'jhon', 'Kolkata', 50000.0)
(102, 'Richard', 'Durgapur', 45000.0)
(103, 'David', 'Mumbai', 40000.0)
(104, 'jeams', 'bangalore', 20000.0)
(105, 'jonyshingh', 'usa', 540000.0)
(106, 'jash', 'pune', 540000.0)
(107, 'joli', 'chennai', 70000.0)
(108, 'jho', 'Kolkata', 50000.0)
(109, 'Ricd', 'Durgapur', 45000.0)
(110, 'keshab', 'london', 780000.0)
(111, 'kish', 'france', 60000.0)
(112, 'jho', 'Kolkata', 50000.0)
(1113, 'Ricd', 'Durgapur', 45000.0)
(113, 'jhoN', 'Kolkata', 540000.0)
(114, 'RiCHIE', 'Durgapur', 45000.0)
(115, 'keshab', 'london', 80000.0)
(116, 'kesto', 'Kolkata', 540000.0)

UPDATED MULTIPLE RECORD

In [150]:
sql="update employee set salary=(540000)where empcode in(110,116,113)"
cur.execute(sql)
db.commit()

In [161]:
cur.execute("update employee set salary=(690000)where empcode in(115,103,108)")
db.commit()

In [162]:
result=cur.execute("select * from employee")
for res in result:
    print(res)

(101, 'jhon', 'Kolkata', 50000.0)
(102, 'Richard', 'Durgapur', 45000.0)
(103, 'David', 'Mumbai', 690000.0)
(104, 'jeams', 'bangalore', 20000.0)
(105, 'jonyshingh', 'usa', 540000.0)
(106, 'jash', 'pune', 540000.0)
(107, 'joli', 'chennai', 70000.0)
(108, 'jho', 'Kolkata', 690000.0)
(109, 'Ricd', 'Durgapur', 45000.0)
(110, 'keshab', 'london', 780000.0)
(111, 'kish', 'france', 60000.0)
(112, 'jho', 'Kolkata', 50000.0)
(1113, 'Ricd', 'Durgapur', 45000.0)
(113, 'jhoN', 'Kolkata', 540000.0)
(114, 'RiCHIE', 'Durgapur', 45000.0)
(115, 'keshab', 'london', 690000.0)
(116, 'kesto', 'Kolkata', 540000.0)

Delete Method

In [163]:
cur.execute("delete from employee where salary=20000")
db.commit()

In [183]:
result=cur.execute("select * from employee")
for res in result:
    print(res)

(101, 'jhon', 'Kolkata', 50000.0)
(102, 'Richard', 'Durgapur', 45000.0)
(103, 'David', 'Mumbai', 40000.0)
(104, 'jeams', 'bangalore', 20000.0)
(105, 'jonyshingh', 'usa', 100000.0)
(106, 'jash', 'pune', 60000.0)
(107, 'joli', 'chennai', 70000.0)

In [165]:
cur.execute("delete from employee where empcode in(115,103,108)")
db.commit()

In [170]:
cur.execute('delete from employee where name like "R%"')
db.commit()

In [171]:
result=cur.execute("select * from employee")
for res in result:
    print(res)

(101, 'jhon', 'Kolkata', 50000.0)
(105, 'jonyshingh', 'usa', 540000.0)
(106, 'jash', 'pune', 540000.0)
(107, 'joli', 'chennai', 70000.0)
(110, 'keshab', 'london', 780000.0)
(111, 'kish', 'france', 60000.0)
(112, 'jho', 'Kolkata', 50000.0)
(113, 'jhoN', 'Kolkata', 540000.0)
(116, 'kesto', 'Kolkata', 540000.0)

DROP FUNCTION

In [194]:
cur.execute('drop table employee')

In [195]:
result=cur.execute("select * from employee")
print(res)

OperationalError: no such table: employee